Revit 2027 API
SpecTypeId.PipeMassPerUnitLength Property
 Mass per Unit Length, in discipline Piping.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PipeMassPerUnitLength { get; }
Public Shared ReadOnly Property PipeMassPerUnitLength As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PipeMassPerUnitLength {
	ForgeTypeId^ get ();
}
static member PipeMassPerUnitLength : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace